class RandomCoffee:
    key = 'random_coffee'
    version = 1
    title = 'Random Coffee'
    def instructions(self, same_city):
        where = 'Вы в одном городе — обязательно воспользуйтесь поводом встретиться за кофе лично. Если не получается — можно онлайн.' if same_city else 'Договоритесь об онлайн-встрече всей группы и выберите удобный сервис звонка.'
        return where + ' Напишите друг другу в Telegram и выберите время. Рекомендуем 20–30 минут. О чём поговорить: чем занимается ваша команда? Что недавно вдохновило? Какое место в городе посоветуете?'
